#include <stdio.h>

int main()
{
    int n = 9; // 00000000 00000000 00000000 00001001
    float *pFloat = (float *)&n;
    printf("n = %d\n", n);
    // 以 float 形式读取： 0 00000000 00000000000000000001001
    // ++ 计算得出  V = (?1)s * 2?126 * (0.00000000000000000001001)2，
    // ++ 是一个很小很小的数，所以屏幕上默认打印小数点后六位的话是 0.000000
    printf("*pFloat = %f\n", *pFloat);

    *pFloat = 9.0;
    // (9.0)10 = (1001.0)2 = (1.0010 * 2^3)2
    // 0 10000010 00100000000000000000000
    printf("num = %d\n", n); // 以整数形式读取为 1,091,567,616
    printf("*pFloat = %f\n", *pFloat);

    return 0;
}
